def load_dictionary(file_path):
    try:
        my_dict = {}
        with open(file_path, 'r', encoding='ansi') as file:
            data = file.read()

        # Разделяем строки по символу '=' и записываем в словарь
        for line in data.split('\n'):
            if '=' in line:
                key, value = line.split('=')
                my_dict[key.strip()] = value.strip()

        return my_dict

    except FileNotFoundError:
        print(f"Ошибка: Файл '{file_path}' не найден.")
        return None

    except Exception as e:
        print(f"Общая ошибка при загрузке словаря: {e}")
        return None


numbers_dict = {
    0: "нул+ей",
    1: "ч+асу",
    2: "двух",
    3: "трёх",
    4: "четыр+ёх",
    5: "пят+и",
    6: "шест+и",
    7: "сем+и",
    8: "восьм+и",
    9: "девят+и",
    10: "десят+и",
    11: "од+иннадцати",
    12: "двен+адцати",
    13: "трин+адцати",
    14: "чет+ырнадцати",
    15: "пятн+адцати",
    16: "шестн+адцати",
    17: "семн+адцати",
    18: "восемн+адцати",
    19: "девятн+адцати",
    20: "двадцат+и",
    21: "двадцат+и одног+о",
    22: "двадцат+и двух",
    23: "двадцат+и трёх",
    24: "двадцат+и четырёх"
}

numbers_dict2 = {
    1: "час",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",
    20: "двадцать",
    21: "двадцать один",
    22: "двадцать два",
    23: "двадцать три"
}

numbers_dict_date = {
    1: "п+ервого",
    2: "втор+ого",
    3: "тр+етьего",
    4: "четв+ёртого",
    5: "п+ятого",
    6: "шест+ого",
    7: "седьм+ого",
    8: "восьм+ого",
    9: "дев+ятого",
    10: "дес+ятого",
    11: "од+иннадцатого",
    12: "двен+адцатого",
    13: "трин+адцатого",
    14: "чет+ырнадцатого",
    15: "пятн+адцатого",
    16: "шестн+адцатого",
    17: "семн+адцатого",
    18: "восемн+адцатого",
    19: "девятн+адцатого",
    20: "двадц+атого",
    21: "дв+адцать п+ервого",
    22: "дв+адцать втор+ого",
    23: "дв+адцать тр+етьего",
    24: "дв+адцать четв+ёртого",
    25: "дв+адцать п+ятого",
    26: "дв+адцать шест+ого",
    27: "дв+адцать седьм+ого",
    28: "дв+адцать восьм+ого",
    29: "дв+адцать дев+ятого",
    30: "тридц+атого",
    31: "тр+идцать п+ервого"
}
